// ВНИМАНИЕ! Соблюдайте форматирование кода (отступы, переносы)

// Объявить три переменных с произвольным именем.
//TODO



// Объявить еще 6 переменных и присвоить им значения произвольных типов данных.
//TODO



// Создать массив из элементов, значения которых представлены всеми возможными типами данных в JavaScript.
//TODO



// Создать объект из четырех свойств. Два свойства должны иметь значения простых типов данных. Два остальных свойства должны иметь значения составного (объектного) типа данных.
//TODO



// Создать 5 объектов представляющих объекты реального мира. В каждом объекте должно быть не меньше 4 свойств.




// Создать 5 массивов представляющих массивы некоторых значений из реальной жизни. В каждом массиве должно быть не меньше 4 элементов.




// Создать массив из трех элементов и написать выражение возвращающее значение второго элемента.
//TODO



// Создать объект из трех свойств и написать выражение возвращающее значение третьего свойства указанного при определении объекта.
//TODO



// Создать массив чисел (не менее 5 чисел) и вычислить сумму этих чисел возведенных в квадрат используя цикл while.
//TODO



// Создать функцию с двумя входными параметрами (числового типа данных) которая возвращает наибольшее из них.
//TODO



// Создать функцию с двумя входными параметрами (числового типа данных) которая возвращает их сумму. Вызвать ее с произвольными аргументами (числового типа данных).
//TODO



// Создать такие структуры данных чтобы выражение
// dro[1]().bro вернуло в качестве результата значение true,
// выражение a[4][1][1].y вернуло строку 'Север',
// выражение b.y().y.z()[3].autor вернуло строку 'Дима'.




// Создать объект со свойствами: x, getX, changeX. Где значение свойства "x" это число, а getX и changeX это методы которые манипулируют значением этого свойства "x". getX возвращает значение свойства "x", а changeX принимает в качестве аргумента число и результатом работы этого метода является присваивание этого числа свойству "x" объекта.
